from algorithms import *
from utils import *

from compare_time import compare_time


def test(matrix):
    print("---------------")
    print("Матрица")
    print_matrix(matrix)
    print(f"Полный перебор: {brut(matrix, 0)}")
    print(f"Муравьиный алгоритм: {ants(matrix, 0.5, 0.5, 0.5, 100, 0)}")
    print("---------------")


def func_tests():
    m = [
        [0, 6, 1, 9, 9],
        [1, 0, 6, 2, 7],
        [1, 4, 0, 6, 5],
        [8, 5, 5, 0, 8],
        [5, 1, 4, 8, 0],
    ]
    test(m)

    m = [
        [0, 4, 2, 5, 9, 4, 4, 9],
        [6, 0, 6, 5, 9, 1, 3, 2],
        [4, 6, 0, 4, 9, 5, 6, 1],
        [7, 1, 6, 0, 4, 1, 2, 6],
        [5, 2, 7, 7, 0, 9, 4, 8],
        [7, 3, 9, 6, 8, 0, 8, 9],
        [9, 5, 4, 1, 3, 3, 0, 4],
        [6, 5, 1, 7, 9, 5, 3, 0],
    ]
    test(m)

    m = [
        [0, 12, 14, 26, 17, 21, 21, 6, 22, 8],
        [18, 0, 9, 23, 8, 7, 27, 17, 25, 11],
        [14, 18, 0, 24, 26, 26, 27, 27, 22, 5],
        [22, 8, 5, 0, 18, 16, 24, 22, 22, 16],
        [23, 19, 26, 7, 0, 11, 1, 5, 5, 28],
        [28, 11, 24, 15, 20, 0, 26, 25, 26, 29],
        [10, 25, 3, 26, 19, 15, 0, 7, 24, 25],
        [19, 17, 8, 11, 10, 27, 19, 0, 23, 9],
        [26, 27, 4, 26, 25, 16, 25, 21, 0, 8],
        [6, 14, 2, 15, 11, 1, 29, 10, 14, 0],
    ]

    test(m)


def show_menu():
    print(
        """
          1 - Решить задачу для введенной матрицы полным перебором. 
          2 - Решить задачу для введенной матрицы муравьиным алгоритмом.
          3 - Выполнить решение заготовленных матриц.
          4 - Провести замерный эксперимент.
          
          0 - Выйти.
          
          """
    )


def main():
    while True:
        show_menu()

        m = int(input("Выберите пункт меню: "))

        if m == 0:
            break
        elif m == 1:
            matrix = matrix_input()
            start = int(input("Введите начальный город: "))

            res = brut(matrix, start)
            print(f"Кратчайший путь {res[1]} длинной {res[0]}")

        elif m == 2:
            matrix = matrix_input()
            start = int(input("Введите начальный город: "))
            temp = int(input("Введите количество дней: "))
            res = ants(matrix, start, days=temp)
            print(f"Кратчайший путь {res[1]} длинной {res[0]}")

        elif m == 3:
            func_tests()

        elif m == 4:
            compare_time()


if __name__ == "__main__":
    main()
